<!DOCTYPE html>
<html>
	<head>
		<title>Expandir y contraer elementos con HTML5 - www.lewebmonster.co</title>
		<link rel="stylesheet" type="text/css" href="css/colapsables.css">
	</head>
	<body>
		<div id="divContenedor">
			<div id="divInfo">
				<h1>Uso de las etiquetas details y summary de HTML5</h1>
				<p>
					Ejemplo por Cali Rojas - <a href="http://www.lewebmonster.com">www.lewebmonster.com</a>
				</p>
			</div>
			<div id="divEjemplo">
				<details open>
				    <summary>&iquest;Qu&eacute; es MVC?</summary>
				    <div class="clsPadding">
				    	<p>
				    		MVC significa Model-View-Controller o Modelo-Vista-Controlador y es
				    		un patr&oacute;n o modelo de abstracci&oacute;n de desarrollo de
				    		software que separa los datos de una aplicaci&oacute;n, la interfaz
				    		de usuario, y la l&oacute;gica de negocio en tres componentes distintos.
				    		El patr&oacute;n de llamada y retorno MVC, se ve frecuentemente en
				    		aplicaciones web, donde la vista es la p&aacute;gina HTML y el c&oacute;digo
				    		que provee de datos din&aacute;micos a la p&aacute;gina. El modelo es el
				    		Sistema de Gesti&oacute;n de Base de Datos y la L&oacute;gica de negocio,
				    		y el controlador es el responsable de recibir los eventos de entrada desde
				    		la vista.
				    	</p>
				    </div>
				</details>
				<details>
					<summary>Frameworks PHP con MVC</summary>
					<div class="clsPadding">
						<details>
							<summary>Zend Framework</summary>
							<div class="clsPadding">
								<p>Este elemento est&aacute; anidado :)</p>
							</div>
						</details>
						<details>
							<summary>Yii Framework</summary>
							<div class="clsPadding">
								<p>Este elemento tambi&eacute;n.</p>
							</div>
						</details>
						<details>
							<summary>Kohana PHP Framework</summary>
							<div class="clsPadding">
								<p>Hola mundo</p>
							</div>
						</details>
					</div>
				</details>
				<details>
				    <summary>&iquest;Qu&eacute; es PHP?</summary>
				    <div class="clsPadding">
				    	<p>
				    		PHP es un lenguaje de programaci&oacute;n de uso general de script del lado del
				    		servidor originalmente dise&ntilde;ado para el desarrollo web de contenido
				    		din&aacute;mico. Fue uno de los primeros lenguajes de programaci&oacute;n del
				    		lado del servidor que se pod&iacute;an incorporar directamente en el documento
				    		HTML en lugar de llamar a un archivo externo que procese los datos. El
				    		c&oacute;digo es interpretado por un servidor web con un m&oacute;dulo de
				    		procesador de PHP que genera la p&aacute;gina Web resultante. PHP ha evolucionado
				    		por lo que ahora incluye tambi&eacute;n una interfaz de l&iacute;nea de comandos
				    		que puede ser usada en aplicaciones gr&aacute;ficas independientes. PHP puede ser
				    		usado en la mayor&iacute;a de los servidores web al igual que en casi todos los
				    		sistemas operativos y plataformas sin ning&uacute;n costo.
				    	</p>
				    </div>
				</details>
			</div>
		</div>
	</body>
</html>